I'm was already able to create a "NULL MX" record through terraform using version 2.10.1 and terraform version 0.12.29 (I know, it's outdated, already updated, but it was the version used to create it :) ).

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ***** will be created
  + resource "cloudflare_record" "cloudflare_dns_record_dns-records_*****" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "@"
      + priority    = 0
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = 1
      + type        = "MX"
      + value       = "."
      + zone_id     = "*****"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

Terraform operation done.
Terraform APPLY [*****]
*****: Creating...
*****: Creation complete after 3s [id=*****]
```